Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_apigatewayv2_api.http will be updated in-place
~ resource "aws_apigatewayv2_api" "http" {
        id                           = "go2gft4394"
        name                         = "wrestleutopia-api"
        tags                         = {}
        # (12 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_credentials = false -> true
            # (5 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.api_dynamo_policy will be updated in-place
~ resource "aws_iam_policy" "api_dynamo_policy" {
        id               = "arn:aws:iam::390402544450:policy/wrestleutopia-api-dynamo"
        name             = "wrestleutopia-api-dynamo"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (1 unchanged element hidden)
                            "dynamodb:GetItem",
                          + "dynamodb:BatchGetItem",
                            "dynamodb:UpdateItem",
                            # (5 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.image_processor will be updated in-place
~ resource "aws_lambda_function" "image_processor" {
        id                             = "wrestleutopia-image-processor"
        tags                           = {}
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TABLE_NAME"    = "wrestleutopia-Tryouts"
              - "TABLE_TRYOUTS" = "wrestleutopia-Tryouts" -> null
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_url will be updated in-place
~ resource "aws_lambda_function" "upload_url" {
        id                             = "wrestleutopia-upload-url"
        tags                           = {}
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TABLE_NAME"     = "wrestleutopia-Tryouts"
              - "TABLE_TRYOUTS"  = "wrestleutopia-Tryouts" -> null
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 0 to add, 6 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```